package com.example.woowahan_mail.data

object DummyData {
    val primaryMail = listOf(
        Mail(
            "Kwang Hyun",
            "안녕하세요 최광현입니다.",
            "우아한테크캠프 열심히 달려보겠습니다.",
            "2022-04-07"
        ),
        Mail(
            "Google",
            "보안 알림",
            "Android에서 새로 로그인함 abc@gmail.com Android Android Android Android",
            "2022-05-07"
        ),
        Mail(
            "David",
            "Let's Connect!",
            "Dear Kwanghyun, We are seeking junior software engineer",
            "2022-06-07"
        ),
        Mail(
            "우아한테크캠프",
            "5기를 모집합니다.",
            "우아한 개발자가 되고 싶은 분들을 위한 우아한테크캠프 모집이 시작되었습니다.",
            "2022-07-07"
        ),
        Mail(
            "Ivy",
            "안드로이드 5기",
            "안드로이드 5기 앞으로 열심히 해봅시다!",
            "2022-11-07"
        ),
    )
    val socialMail = listOf(
        Mail(
            "Kakao",
            "카카오톡 PC 인증",
            "인증번호는 5095입니다.",
            "2022-04-07"
        ),
        Mail(
            "Instagram",
            "댓글 달림",
            "게시물에 새로운 댓글이 달렸습니다.",
            "2022-05-07"
        ),
        Mail(
            "Facebook",
            "가입한 그룹에 새로운 글이 등록됐습니다",
            "새로운 소식을 확인해주세요",
            "2022-08-07"
        ),
        Mail(
            "Slack",
            "안드로이드 5기",
            "안드로이드 5기 앞으로 열심히 해봅시다!",
            "2022-11-07"
        ),
        Mail(
            "Github",
            "우아한테크캠프",
            "깃에 초대되셨습니다. 수락하시겠습니까?",
            "2022-12-07"
        )
    )
    val promotionsMail = listOf(
        Mail(
            "우아한테크캠프",
            "5기를 모집합니다.",
            "우아한 개발자가 되고 싶은 분들을 위한 우아한테크캠프 모집이 시작되었습니다.",
            "2022-07-07"
        ),
        Mail(
            "우아한테크캠프",
            "4기를 모집합니다.",
            "우아한 개발자가 되고 싶은 분들을 위한 우아한테크캠프 모집이 시작되었습니다.",
            "2021-07-07"
        ),
        Mail(
            "우아한테크캠프",
            "3기를 모집합니다.",
            "우아한 개발자가 되고 싶은 분들을 위한 우아한테크캠프 모집이 시작되었습니다.",
            "2020-07-07"
        ),
        Mail(
            "우아한테크캠프",
            "2기를 모집합니다.",
            "우아한 개발자가 되고 싶은 분들을 위한 우아한테크캠프 모집이 시작되었습니다.",
            "2019-07-07"
        ),
        Mail(
            "우아한테크캠프",
            "1기를 모집합니다.",
            "우아한 개발자가 되고 싶은 분들을 위한 우아한테크캠프 모집이 시작되었습니다.",
            "2018-07-07"
        ),
    )
}